def main():
    b = ['a','b','c'] # 串列
    for i in range(len(b)):
        print(b[i],i) # 輸出字母+其對應的位置
main()

'''
 !! 'list' object has no attribute 'split'

 x = [1,2,5,7,8]

 x[0] --> 1
 type(1) --> <class 'int'>
 x[1:3] --> [2, 5]
 x[::-1] --> [8, 7, 5, 2, 1]
 x.append(9) --> [1, 2, 5, 7, 8, 9]
 x.pop() --> 9 (x= [1, 2, 5, 7, 8])
 x.pop(2) --> 5 (x= [1, 2, 7, 8, 9])
 >>> x=[1,2,3,4,5]
 >>> y=x.pop(2)
 >>> print(y,x)  --> 3 [1, 2, 4, 5]
 x. insert(10,1) --> [1, 2, 5, 7, 8, 1]  #括弧中一定要放兩個(位置,值)
 x. insert(1,10) --> [1, 10, 2, 5, 7, 8, 1]
 x.remove(8) --> [1, 2, 5, 7]
 x.sort() --> [1, 2, 5, 7, 8]

 x = [1,2,5,8] + [7,2,21] --> [1, 2, 5, 8, 7, 2, 21]
 x.sort() --> [1, 2, 2, 5, 7, 8, 21]  #由小到大排序
 x = sorted([a,b,c])
 x.sort(reverse=True) --> [21, 8, 7, 5, 2, 2, 1]  #由大到小排序

'''